
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 6 to change, 6 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
* Replace
  * module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/8c6df56b40de459f9992e76cd758d893"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/7aa9cfb4358f4bd787b58b3d5f7b6087"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-listen-connection-string/3a33ebc7a47c42988466f103920a77d0"
        name                    = "update-case-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/6922b4412d1e4fc28d5287101b8f0029"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "lastUpdated"  = "2023-10-04T17:11:11Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.Insights/components/ethos-aat"
        name                                  = "ethos-aat"
        tags                                  = {
            "application"         = "ethos"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "staging"
            "managedBy"           = "Ethos Replacement"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (14 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-aat"
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-aat"
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":49,"Program":"tfcmt","SHA1":"","Vars":{}} -->